In [15]:
import numpy as np
import pandas as pd

In [18]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75,- 1.3]],
                 index=['a', 'b', 'c', 'd'],
                 columns=['one', 'two']
                 )
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [20]:
df.sum() # soma com o index

one    9.25
two   -5.80
dtype: float64

In [21]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [22]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [24]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [26]:
df.mean(axis='columns', skipna=True) # Calcula a média independente se não tiver em comum

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [28]:
df.idxmax() # estatísticas indiretas como o valor do índice em que os valores mínimo e máximo são encontrados

one    b
two    d
dtype: object

In [29]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [31]:
df.describe() # descreve

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000